Autodesk.Revit.DB.Structure.RebarShapeConstraintAngleFromFixedDir.Direction
A fixed direction in UV-space. The parameter will drive
the segment's angle relative to this direction.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: direction has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintAngleFromFixedDir.Sign
When the sign is 1, the Direction is rotated clockwise by the angle's value.
When -1, the Direction is rotated counter-clockwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: sign is not 1 or -1.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintAngleFromFixedDir.#ctor(Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.UV)
Create an angular constraint.
paramId:
A Rebar Shape parameter of type UT_Angle.
sign:
The sign of the angle relative to the direction.
direction:
A fixed direction in UV-space.
Throws Autodesk.Revit.Exceptions.ArgumentException:
sign is not 1 or -1.
-or-
paramId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
direction has zero length.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintAngleFromFixedDir
A constraint which can be applied to a RebarShapeSegment and drives the angle
of the segment relative to a fixed direction in UV-space.
Since:
2012